let pinyin = require('js-pinyin');

let rubType=[
  // {
  //   type:1,
  //   list:[
  //     '报纸','图书','纸盒','塑料袋','餐具','牙刷','杯子','矿泉水瓶','玻璃瓶','镜子',
  //     '易拉罐','铁钉','铁管','废弃衣服','毛巾','书包','毛绒玩具','珍珠','iPad','冰箱',
  //     '木制菜板','电话','电脑','安全帽','高跟鞋','电视机','空调','美工刀','泡沫','耳环',
  //     '风扇','充电线','吸尘器','吹风机','耳机'
  //     ]
  // },
  {
    type:2,
    list:[
      '米','栗子','槟榔皮','爆米花','花','虾','肉','糖','包子','白煮蛋壳','蛋',
      '葱','蒜','臭豆腐','菠萝','螃蟹壳','菠萝蜜','八角','面包','艾草','草',
      '炒面','花生壳','花生米','棒棒糖','八宝粥','茶','豆腐','茶叶','虫子','橙子皮',
      '青菜','胡萝卜','大饼','芭蕉叶','落叶','饼干','瓜子','草莓','橙子','螃蟹壳',
      ]
  },
  {
    type:3,
    list:[
      '包书皮','百洁布','电蚊香','蚊香片','吃过的口香糖','塑料的一次性饭盒','饼干袋','薯片袋','大骨头','包装干燥剂','茶包',
      '瓶装饮料','红笔','过期口红','洗衣粉','被污染的衣服','核桃壳','大排骨','乒乓球','牙刷','曲别针',
      '502胶水','创可贴','花蛤壳','奶茶杯','榴莲皮','花甲壳','吸管','笔袋','胶布','爆竹',
      '尺子','茶壶','磁带','编织袋','打火机','蜡笔','订书机','尿不湿','橙子','螃蟹壳'
      ]
  },
  {
    type:4,
    list:[
      '胶囊','口服液瓶','口服液瓶盖','荧光灯','Led灯','纽扣电池','充电电池','过期指甲油','白炽灯','水银体温计','过期保健品',
      '蓄电池','维生素','油漆','过期化妆品'
      ]
  }
]
let rubbishList=[]
rubType.forEach(x=>{
  x.list.forEach(l=>{
    rubbishList.push( {name:l,type:x.type,pic:pinyin.getFullChars(l).toLowerCase(),remarks:''})
  })
})
console.log(rubbishList);
export default rubbishList